/*
    7.编写一个程序，初始化一个double类型的二维数组，使用编程练习2中的一个拷贝函数把该数组中的数据拷贝至另一个二维数组中（因为二维数组是数组的数组，所以可以使用处理一维数组的拷贝函数来处理数组中的每个子数组）。
*/

#include <stdio.h>

void copy_arr(double copy[], double const source[], int n)
{
    for (int i = 0; i < n; i++)
        copy[i] = source[i];
}

int main(void)
{
    double source[5][12] = 
    {
        {4.3,4.3,4.3,3.0,2.0,1.2,0.2,0.2,0.4,2.4,3.5,6.6},
        {8.5,8.2,1.2,1.6,2.4,0.0,5.2,0.9,0.3,0.9,1.4,7.3},
        {9.1,8.5,6.7,4.3,2.1,0.8,0.2,0.2,1.1,2.3,6.1,8.4},
        {7.2,9.9,8.4,3.3,1.2,0.8,0.4,0.0,0.6,1.7,4.3,6.2},
        {7.6,5.6,3.8,2.8,3.8,0.2,0.0,0.0,0.0,1.3,2.6,5.2}
    };
    double copy[5][12] = {0.0};

    printf("copy array is:\n");

    for (int i = 0; i < 5; i++)
        copy_arr(copy[i], source[i], 12);

    for (int i = 0; i < 5; i++)
    {
        for (int j = 0; j < 12; j++)
            printf("%-5g", copy[i][j]);
        putchar('\n');
    }

    return 0;
}